#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`
<details><summary>Show Plan</summary>
```

terraform
data.azurerm_dns_zone.default: Reading...
azurerm_resource_group.default: Refreshing state... [id=/subscriptions/8b956240-12c7-4e8e-b328-958fb0a78713/resourceGroups/efit-web-develop-rg]
data.azurerm_kubernetes_cluster.aks: Reading...
azurerm_public_ip.lb-pip: Refreshing state... [id=/subscriptions/8b956240-12c7-4e8e-b328-958fb0a78713/resourceGroups/efit-web-develop-rg/providers/Microsoft.Network/publicIPAddresses/efit-web-develop-pip]
data.azurerm_dns_zone.default: Read complete after 1s [id=/subscriptions/8b956240-12c7-4e8e-b328-958fb0a78713/resourceGroups/efit-dns-zone-rg/providers/Microsoft.Network/dnsZones/efit-web.site]
data.azurerm_kubernetes_cluster.aks: Read complete after 2s [id=/subscriptions/8b956240-12c7-4e8e-b328-958fb0a78713/resourceGroups/efit-aks-rg/providers/Microsoft.ContainerService/managedClusters/efit-aks]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # azurerm_public_ip.lb-pip must be replaced
-/+ resource "azurerm_public_ip" "lb-pip" {
      + fqdn                    = (known after apply)
      ~ id                      = "/subscriptions/8b956240-12c7-4e8e-b328-958fb0a78713/resourceGroups/efit-web-develop-rg/providers/Microsoft.Network/publicIPAddresses/efit-web-develop-pip" -> (known after apply)
      ~ ip_address              = "172.172.137.198" -> (known after apply)
      - ip_tags                 = {} -> null
      ~ name                    = "efit-web-develop-pip" -> "efit-web-default-pip" # forces replacement
      ~ resource_group_name     = "efit-web-develop-rg" -> "efit-web-default-rg" # forces replacement
      - tags                    = {} -> null
      - zones                   = [] -> null
        # (8 unchanged attributes hidden)
    }

  # azurerm_resource_group.default must be replaced
-/+ resource "azurerm_resource_group" "default" {
      ~ id         = "/subscriptions/8b956240-12c7-4e8e-b328-958fb0a78713/resourceGroups/efit-web-develop-rg" -> (known after apply)
      ~ name       = "efit-web-develop-rg" -> "efit-web-default-rg" # forces replacement
        tags       = {
            "type" = "webapp"
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.aks_network_contributor will be created
  + resource "azurerm_role_assignment" "aks_network_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "db831c31-2ed3-457e-af99-34fab8694984"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 3 to add, 0 to change, 2 to destroy.

```
</details>
*Pushed by: @Jabronious, Action: `pull_request`*